Белгипрозем_2017/src/Catalogs/УведомленияПрограммы/УведомленияПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УведомленияПрограммы</name>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>EnumRef.ВидыУведомленийПрограммы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Enums/ВидыУведомленийПрограммы/ВидыУведомленийПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУведомленийПрограммы</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/УведомленияПрограммы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	Элементы.ДекорацияПредставлениеУведомления.Заголовок = Строка(Объект.Ссылка);
	
	Если Объект.ВидУведомления = Перечисления.ВидыУведомленийПрограммы.Ошибка Тогда
		Элементы.ДекорацияУведомления.Картинка = БиблиотекаКартинок.Остановить;
	ИначеЕсли Объект.ВидУведомления = Перечисления.ВидыУведомленийПрограммы.Предупреждение Тогда
		Элементы.ДекорацияУведомления.Картинка = БиблиотекаКартинок.Предупреждение;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь(ТекущийПользователь);
	
	Элементы.ФормаПометитьНаУдаление.Видимость = 
		НЕ Объект.ПометкаУдаления
		И (ТекущийПользователь = Объект.Пользователь
			ИЛИ ЭтоПолноправныйПользователь);
		
	Элементы.Пользователь.Видимость = ТекущийПользователь <> Объект.Пользователь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	ТекстВопроса = НСтр("ru = 'Удалить уведомление?'");
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(Истина, "Удалить");
	СписокКнопок.Добавить(Ложь, "Отмена");
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПометитьНаУдалениеПродолжение",
		ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеПродолжение(Ответ, Параметры) Экспорт
	
	Если Ответ Тогда
		ПометитьНаУдалениеНаСервере(Объект.Ссылка);
		Закрыть();
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Помечает на удаление Уведомление.
//
// Параметры:
//   - Уведомление - СправочникОбъект.УведомленияПрограммы
//
&НаСервереБезКонтекста
Процедура ПометитьНаУдалениеНаСервере(Уведомление)
	
	УведомлениеОбъект = Уведомление.ПолучитьОбъект();
	УведомлениеОбъект.Заблокировать();
	УведомлениеОбъект.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры

#КонецОбласти
